# Переписать при помощи словарей: ключ - значение (task8)

seasons = {
    12: "Зима", 1: "Зима", 2: "Зима",
    3: "Весна", 4: "Весна", 5: "Весна",
    6: "Лето", 7: "Лето", 8: "Лето",
    9: "Осень", 10: "Осень", 11: "Осень"
}

while True:
    try:
        month = int(input("Введите номер месяца (от 1 до 12): "))
        if 1 <= month <= 12:
            print(seasons[month])
            break
        else:
            print("Ошибка: введите число от 1 до 12")
    except ValueError:
        print("Ошибка ввода")